/*------------------------------------------------------------------------
                              Thông tin cá nhân                            
--------------------------------------------------------------------------
-------------------------- Họ tên: Đào Minh Đức --------------------------
------------------------------ MSSV: 2159003 -----------------------------
------------------------------- Bài tập 11 -------------------------------
------------------------------------------------------------------------*/

#include <iostream>
using namespace std;

int main()
{
    long long n, rev = 0, rem;

    cout << "Nhap so nguyen: ";
    cin >> n;

    while(n != 0)
    {
        rem = n % 10;           // Lấy chữ số cuối cùng hiện tại của n
        rev = (rev * 10) + rem; // Cộng số đó vào cuối số rev
        n /= 10;                // Bỏ đi chữ số cuối của n
    }

    cout << "So nguyen dao nguoc la: " << rev;
    
    return 0;
}