/*------------------------------------------------------------------------
                              Thông tin cá nhân                            
--------------------------------------------------------------------------
-------------------------- Họ tên: Đào Minh Đức --------------------------
------------------------------ MSSV: 2159003 -----------------------------
------------------------------- Bài tập 13 -------------------------------
------------------------------------------------------------------------*/

#include <iostream>
using namespace std;

int main()
{
    int size = 3;
    long long arr[size], min;

    cout << "Nhap vao " << size << " so nguyen: ";

    for (int i = 0; i < size; i++)
    {
        cin >> arr[i];
    }

    min = arr[0];

    for (int i = 0; i < size; i++)
    {
        if(arr[i] < min)
        {
            min = arr[i];
        }
    }

    cout << endl << "So nho nhat la: " << min << endl;

    return 0;
}