/*------------------------------------------------------------------------
                              Thông tin cá nhân                            
--------------------------------------------------------------------------
-------------------------- Họ tên: Đào Minh Đức --------------------------
------------------------------ MSSV: 2159003 -----------------------------
------------------------------- Bài tập 15 -------------------------------
------------------------------------------------------------------------*/

#include <iostream>
using namespace std;

int main()
{
    long long inp, n_10, n_05, n_02, n_01;

    cout << endl << "Nhap so tien can doi: ";
    cin >> inp;

    // Lấy đến hàng chục
    n_10 = inp;
    n_10 /= 10;

    // Lấy phần đơn vị
    n_05 = (inp % 10) / 5;

    // Lấy phần sót lại
    n_02 = ((inp % 10) - (n_05 * 5)) / 2;

    n_01 = ((inp % 10) - (n_05 * 5) - (n_02 * 2));

    cout << "So tien cua ban se duoc quy doi thanh: \n";
    
    if (n_10 != 0)
    {
        cout << n_10 << " to 10 dong\n";
    }

    if (n_05 != 0)
    {
        cout << n_05 << " to 5 dong\n";
    }

    if (n_02 != 0)
    {
        cout << n_02 << " to 2 dong\n";
    }

    if (n_01 != 0)
    {
        cout << n_01 << " to 1 dong\n";
    }
    
    return 0;
}