/*------------------------------------------------------------------------
                              Thông tin cá nhân                            
--------------------------------------------------------------------------
-------------------------- Họ tên: Đào Minh Đức --------------------------
------------------------------ MSSV: 2159003 -----------------------------
------------------------------- Bài tập 06 -------------------------------
------------------------------------------------------------------------*/

#include <iostream>
using namespace std;

int main()
{
    long long inp;

    cout << endl << "Nhap mot so nguyen duong: ";
    cin >> inp;

    if (inp < 0)
    {
        cout << endl << "Gia tri nhap vao khong hop le." << endl;
        main();
    }

    else
    {
        if (inp < 100)
        {
            cout << endl << "0" << endl;
        }

        else
        {
            cout << endl << ((inp /= 100) % 10) << endl;        // Lấy chữ số hàng trăm
        }
    }

    return 0;
}