/*------------------------------------------------------------------------
                              Thông tin cá nhân                            
--------------------------------------------------------------------------
-------------------------- Họ tên: Đào Minh Đức --------------------------
------------------------------ MSSV: 2159003 -----------------------------
------------------------------- Bài tập 02 -------------------------------
------------------------------------------------------------------------*/

#include <iostream>
using namespace std;

int main()
{
    long long n;

    cout << "Nhap so nguyen: ";
    cin >> n;

    cout << endl << "Cac so chia het cho 3 trong khoang tu 1 den " << n << " la:";
    
    switch (n > 0)
    {
        case true:
        {
            for (int i = 1; i <= n; i++)
            {
                if (i % 3 == 0)
                {
                    cout << endl << i;
                }
            }
        }

        case false:
        {
            for (int i = 1; i <= n; i--)
            {
                if (i % 3 == 0)
                {
                    cout << endl << i;
                }
            }
        }
    }
    
    
    return 0;
}